/*Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

a = 5; b = 7 -> max = 7
a = 2 b = 10 -> max = 10
a = -9 b = -3 -> max = -3
*/

/*
Console.Write("Введите первое число: ");
int firstNumber = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число: ");
int secondNumber   = Convert.ToInt32(Console.ReadLine());

 if(firstNumber > secondNumber)
{
    Console.WriteLine("Первое число больше второго");
}
else
{
    Console.WriteLine("Первое число меньше второго");
}
*/

/*
Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

2, 3, 7 -> 7
44 5 78 -> 78
22 3 9 -> 22
*/

/*
Console.Write("Введите первое число: ");
int firstNumber = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите второе число: ");
int secondNumber = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите третье число: ");
int thirdNumber = Convert.ToInt32(Console.ReadLine());

if(secondNumber > firstNumber && secondNumber > thirdNumber)
{
    Console.WriteLine($"Максимальное число: {secondNumber}");
}
else if (thirdNumber > secondNumber && thirdNumber > firstNumber)
{
    Console.WriteLine($"Максимальное число: {thirdNumber}");
}
else 
{
    Console.WriteLine($"Максимальное число: {firstNumber}");
}
*/

/*
Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

4 -> да
-3 -> нет
7 -> нет
*/

/*
Console.Write("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());

int even = number % 2;

if (even == 0) 
{
    Console.WriteLine($"Число: {number} четное");
}
else
{
    Console.WriteLine($"Число: {number} не четное");
}
*/